{
  "status": 0,
  "data": {
    "Details": {
      "Listening services": {
        "tcp": {
          "443": {
            "Details": "product: Apache httpd version: 2.2.22 extrainfo: (Debian)",
            "Possible vulnerabilities": {
              "CVE-2016-8612": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-8612",
                "Description": "An error was found in protocol parsing logic of mod_cluster load balancer Apache HTTP Server modules. An attacker could use this flaw to cause a Segmentation Fault in the serving httpd process.",
                "Score": {
                  "CVSSv2": 3.3,
                  "CVSSv3": 4.3
                }
              },
              "CVE-2022-37436": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-37436",
                "Description": "Prior to Apache HTTP Server 2.4.55, a malicious backend can cause the response headers to be truncated early, resulting in some headers being incorporated into the response body. If the later headers have any security purpose, they will not be interpreted by the client.",
                "Score": {
                  "CVSSv2": "N.A.",
                  "CVSSv3": 5.3
                }
              },
              "CVE-2006-20001": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2006-20001",
                "Description": "A carefully crafted If: request header can cause a memory read, or write of a single zero byte, in a pool (heap) memory location beyond the header value sent. This could cause the process to crash. This issue affects Apache HTTP Server 2.4.54 and earlier.",
                "Score": {
                  "CVSSv2": "N.A.",
                  "CVSSv3": 7.5
                }
              },
              "CVE-2021-44790": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-44790",
                "Description": "A carefully crafted request body can cause a buffer overflow in the mod_lua multipart parser (r:parsebody() called from Lua scripts). The Apache httpd team is not aware of an exploit for the vulnerabilty though it might be possible to craft one. This issue affects Apache HTTP Server 2.4.51 and earlier.",
                "Score": {
                  "CVSSv2": 7.5,
                  "CVSSv3": 9.8
                }
              },
              "CVE-2022-22719": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-22719",
                "Description": "A carefully crafted request body can cause a read to a random memory area which could cause the process to crash. This issue affects Apache HTTP Server 2.4.52 and earlier.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": 7.5
                }
              },
              "CVE-2022-22720": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-22720",
                "Description": "Apache HTTP Server 2.4.52 and earlier fails to close inbound connection when errors are encountered discarding the request body, exposing the server to HTTP Request Smuggling",
                "Score": {
                  "CVSSv2": 7.5,
                  "CVSSv3": 9.8
                }
              },
              "CVE-2022-22721": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-22721",
                "Description": "If LimitXMLRequestBody is set to allow request bodies larger than 350MB (defaults to 1M) on 32 bit systems an integer overflow happens which later causes out of bounds writes. This issue affects Apache HTTP Server 2.4.52 and earlier.",
                "Score": {
                  "CVSSv2": 5.8,
                  "CVSSv3": 9.1
                }
              },
              "CVE-2021-34798": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-34798",
                "Description": "Malformed requests may cause the server to dereference a NULL pointer. This issue affects Apache HTTP Server 2.4.48 and earlier.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": 7.5
                }
              },
              "CVE-2021-32791": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32791",
                "Description": "mod_auth_openidc is an authentication/authorization module for the Apache 2.x HTTP server that functions as an OpenID Connect Relying Party, authenticating users against an OpenID Connect Provider. In mod_auth_openidc before version 2.4.9, the AES GCM encryption in mod_auth_openidc uses a static IV and AAD. It is important to fix because this creates a static nonce and since aes-gcm is a stream cipher, this can lead to known cryptographic issues, since the same key is being reused. From 2.4.9 onwards this has been patched to use dynamic values through usage of cjose AES encryption routines.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": 5.9
                }
              },
              "CVE-2021-39275": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-39275",
                "Description": "ap_escape_quotes() may write beyond the end of a buffer when given malicious input. No included modules pass untrusted data to these functions, but third-party / external modules may. This issue affects Apache HTTP Server 2.4.48 and earlier.",
                "Score": {
                  "CVSSv2": 7.5,
                  "CVSSv3": 9.8
                }
              },
              "CVE-2021-40438": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-40438",
                "Description": "A crafted request uri-path can cause mod_proxy to forward the request to an origin server choosen by the remote user. This issue affects Apache HTTP Server 2.4.48 and earlier.",
                "Score": {
                  "CVSSv2": 6.8,
                  "CVSSv3": 9.0
                }
              },
              "CVE-2008-0455": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2008-0455",
                "Description": "Cross-site scripting (XSS) vulnerability in the mod_negotiation module in the Apache HTTP Server 2.2.6 and earlier in the 2.2.x series, 2.0.61 and earlier in the 2.0.x series, and 1.3.39 and earlier in the 1.3.x series allows remote authenticated users to inject arbitrary web script or HTML by uploading a file with a name containing XSS sequences and a file extension, which leads to injection within a (1) \"406 Not Acceptable\" or (2) \"300 Multiple Choices\" HTTP response when the extension is omitted in a request for the file.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2014-0098": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-0098",
                "Description": "The log_cookie function in mod_log_config.c in the mod_log_config module in the Apache HTTP Server before 2.4.8 allows remote attackers to cause a denial of service (segmentation fault and daemon crash) via a crafted cookie that is not properly handled during truncation.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2012-0883": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-0883",
                "Description": "envvars (aka envvars-std) in the Apache HTTP Server before 2.4.2 places a zero-length directory name in the LD_LIBRARY_PATH, which allows local users to gain privileges via a Trojan horse DSO in the current working directory during execution of apachectl.",
                "Score": {
                  "CVSSv2": 6.9,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2013-1862": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-1862",
                "Description": "mod_rewrite.c in the mod_rewrite module in the Apache HTTP Server 2.2.x before 2.2.25 writes data to a log file without sanitizing non-printable characters, which might allow remote attackers to execute arbitrary commands via an HTTP request containing an escape sequence for a terminal emulator.",
                "Score": {
                  "CVSSv2": 5.1,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2013-1896": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-1896",
                "Description": "mod_dav.c in the Apache HTTP Server before 2.2.25 does not properly determine whether DAV is enabled for a URI, which allows remote attackers to cause a denial of service (segmentation fault) via a MERGE request in which the URI is configured for handling by the mod_dav_svn module, but a certain href attribute in XML data refers to a non-DAV URI.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2013-6438": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-6438",
                "Description": "The dav_xml_get_cdata function in main/util.c in the mod_dav module in the Apache HTTP Server before 2.4.8 does not properly remove whitespace characters from CDATA sections, which allows remote attackers to cause a denial of service (daemon crash) via a crafted DAV WRITE request.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2014-0118": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-0118",
                "Description": "The deflate_in_filter function in mod_deflate.c in the mod_deflate module in the Apache HTTP Server before 2.4.10, when request body decompression is enabled, allows remote attackers to cause a denial of service (resource consumption) via crafted request data that decompresses to a much larger size.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2014-0226": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-0226",
                "Description": "Race condition in the mod_status module in the Apache HTTP Server before 2.4.10 allows remote attackers to cause a denial of service (heap-based buffer overflow), or possibly obtain sensitive credential information or execute arbitrary code, via a crafted request that triggers improper scoreboard handling within the status_handler function in modules/generators/mod_status.c and the lua_ap_scoreboard_worker function in modules/lua/lua_request.c.",
                "Score": {
                  "CVSSv2": 6.8,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2016-5387": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-5387",
                "Description": "The Apache HTTP Server through 2.4.23 follows RFC 3875 section 4.1.18 and therefore does not protect applications from the presence of untrusted client data in the HTTP_PROXY environment variable, which might allow remote attackers to redirect an application's outbound HTTP traffic to an arbitrary proxy server via a crafted Proxy header in an HTTP request, aka an \"httpoxy\" issue.  NOTE: the vendor states \"This mitigation has been assigned the identifier CVE-2016-5387\"; in other words, this is not a CVE ID for a vulnerability.",
                "Score": {
                  "CVSSv2": 6.8,
                  "CVSSv3": 8.1
                }
              },
              "CVE-2016-8743": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-8743",
                "Description": "Apache HTTP Server, in all releases prior to 2.2.32 and 2.4.25, was liberal in the whitespace accepted from requests and sent in response lines and headers. Accepting these different behaviors represented a security concern when httpd participates in any chain of proxies or interacts with back-end application servers, either through mod_proxy or using conventional CGI mechanisms, and may result in request smuggling, response splitting and cache pollution.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": 7.5
                }
              },
              "CVE-2022-28614": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-28614",
                "Description": "The ap_rwrite() function in Apache HTTP Server 2.4.53 and earlier may read unintended memory if an attacker can cause the server to reflect very large input using ap_rwrite() or ap_rputs(), such as with mod_luas r:puts() function. Modules compiled and distributed separately from Apache HTTP Server that use the 'ap_rputs' function and may pass it a very large (INT_MAX or larger) string must be compiled against current headers to resolve the issue.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": 5.3
                }
              },
              "CVE-2022-29404": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-29404",
                "Description": "In Apache HTTP Server 2.4.53 and earlier, a malicious request to a lua script that calls r:parsebody(0) may cause a denial of service due to no default limit on possible input size.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": 7.5
                }
              },
              "CVE-2022-28615": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-28615",
                "Description": "Apache HTTP Server 2.4.53 and earlier may crash or disclose information due to a read beyond bounds in ap_strcmp_match() when provided with an extremely large input buffer. While no code distributed with the server can be coerced into such a call, third-party modules or lua scripts that use ap_strcmp_match() may hypothetically be affected.",
                "Score": {
                  "CVSSv2": 6.4,
                  "CVSSv3": 9.1
                }
              },
              "CVE-2022-31813": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-31813",
                "Description": "Apache HTTP Server 2.4.53 and earlier may not send the X-Forwarded-* headers to the origin server based on client side Connection header hop-by-hop mechanism. This may be used to bypass IP based authentication on the origin server/application.",
                "Score": {
                  "CVSSv2": 7.5,
                  "CVSSv3": 9.8
                }
              },
              "CVE-2022-30556": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-30556",
                "Description": "Apache HTTP Server 2.4.53 and earlier may return lengths to applications calling r:wsread() that point past the end of the storage allocated for the buffer.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": 7.5
                }
              },
              "CVE-2022-28330": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-28330",
                "Description": "Apache HTTP Server 2.4.53 and earlier on Windows may read beyond bounds when configured to process requests with the mod_isapi module.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": 5.3
                }
              },
              "CVE-2021-32792": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32792",
                "Description": "mod_auth_openidc is an authentication/authorization module for the Apache 2.x HTTP server that functions as an OpenID Connect Relying Party, authenticating users against an OpenID Connect Provider. In mod_auth_openidc before version 2.4.9, there is an XSS vulnerability in when using `OIDCPreservePost On`.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": 6.1
                }
              },
              "CVE-2021-32786": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32786",
                "Description": "mod_auth_openidc is an authentication/authorization module for the Apache 2.x HTTP server that functions as an OpenID Connect Relying Party, authenticating users against an OpenID Connect Provider. In versions prior to 2.4.9, `oidc_validate_redirect_url()` does not parse URLs the same way as most browsers do. As a result, this function can be bypassed and leads to an Open Redirect vulnerability in the logout functionality. This bug has been fixed in version 2.4.9 by replacing any backslash of the URL to redirect with slashes to address a particular breaking change between the different specifications (RFC2396 / RFC3986 and WHATWG). As a workaround, this vulnerability can be mitigated by configuring `mod_auth_openidc` to only allow redirection whose destination matches a given regular expression.",
                "Score": {
                  "CVSSv2": 5.8,
                  "CVSSv3": 6.1
                }
              },
              "CVE-2021-32785": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-32785",
                "Description": "mod_auth_openidc is an authentication/authorization module for the Apache 2.x HTTP server that functions as an OpenID Connect Relying Party, authenticating users against an OpenID Connect Provider. When mod_auth_openidc versions prior to 2.4.9 are configured to use an unencrypted Redis cache (`OIDCCacheEncrypt off`, `OIDCSessionType server-cache`, `OIDCCacheType redis`), `mod_auth_openidc` wrongly performed argument interpolation before passing Redis requests to `hiredis`, which would perform it again and lead to an uncontrolled format string bug. Initial assessment shows that this bug does not appear to allow gaining arbitrary code execution, but can reliably provoke a denial of service by repeatedly crashing the Apache workers. This bug has been corrected in version 2.4.9 by performing argument interpolation only once, using the `hiredis` API. As a workaround, this vulnerability can be mitigated by setting `OIDCCacheEncrypt` to `on`, as cache keys are cryptographically hashed before use when this option is enabled.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": 7.5
                }
              },
              "CVE-2013-5704": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-5704",
                "Description": "The mod_headers module in the Apache HTTP Server 2.2.22 allows remote attackers to bypass \"RequestHeader unset\" directives by placing a header in the trailer portion of data sent with chunked transfer coding.  NOTE: the vendor states \"this is not a security issue in httpd as such.\"",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2018-1303": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2018-1303",
                "Description": "A specially crafted HTTP request header could have crashed the Apache HTTP Server prior to version 2.4.30 due to an out of bound read while preparing data to be cached in shared memory. It could be used as a Denial of Service attack against users of mod_cache_socache. The vulnerability is considered as low risk since mod_cache_socache is not widely used, mod_cache_disk is not concerned by this vulnerability.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": 7.5
                }
              },
              "CVE-2018-1302": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2018-1302",
                "Description": "When an HTTP/2 stream was destroyed after being handled, the Apache HTTP Server prior to version 2.4.30 could have written a NULL pointer potentially to an already freed memory. The memory pools maintained by the server make this vulnerability hard to trigger in usual configurations, the reporter and the team could not reproduce it outside debug builds, so it is classified as low risk.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": 5.9
                }
              },
              "CVE-2018-1301": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2018-1301",
                "Description": "A specially crafted request could have crashed the Apache HTTP Server prior to version 2.4.30, due to an out of bound access after a size limit is reached by reading the HTTP header. This vulnerability is considered very hard if not impossible to trigger in non-debug mode (both log and build level), so it is classified as low risk for common server usage.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": 5.9
                }
              },
              "CVE-2017-9798": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-9798",
                "Description": "Apache httpd allows remote attackers to read secret data from process memory if the Limit directive can be set in a user's .htaccess file, or if httpd.conf has certain misconfigurations, aka Optionsbleed. This affects the Apache HTTP Server through 2.2.34 and 2.4.x through 2.4.27. The attacker sends an unauthenticated OPTIONS HTTP request when attempting to read secret data. This is a use-after-free issue and thus secret data is not always sent, and the specific data depends on many factors including configuration. Exploitation with .htaccess can be blocked with a patch to the ap_limit_section function in server/core.c.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": 7.5
                }
              },
              "CVE-2017-9788": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-9788",
                "Description": "In Apache httpd before 2.2.34 and 2.4.x before 2.4.27, the value placeholder in [Proxy-]Authorization headers of type 'Digest' was not initialized or reset before or between successive key=value assignments by mod_auth_digest. Providing an initial key with no '=' assignment could reflect the stale value of uninitialized pool memory used by the prior request, leading to leakage of potentially confidential information, and a segfault in other cases resulting in denial of service.",
                "Score": {
                  "CVSSv2": 6.4,
                  "CVSSv3": 9.1
                }
              },
              "CVE-2017-7679": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-7679",
                "Description": "In Apache httpd 2.2.x before 2.2.33 and 2.4.x before 2.4.26, mod_mime can read one byte past the end of a buffer when sending a malicious Content-Type response header.",
                "Score": {
                  "CVSSv2": 7.5,
                  "CVSSv3": 9.8
                }
              },
              "CVE-2017-3169": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-3169",
                "Description": "In Apache httpd 2.2.x before 2.2.33 and 2.4.x before 2.4.26, mod_ssl may dereference a NULL pointer when third-party modules call ap_hook_process_connection() during an HTTP request to an HTTPS port.",
                "Score": {
                  "CVSSv2": 7.5,
                  "CVSSv3": 9.8
                }
              },
              "CVE-2017-3167": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-3167",
                "Description": "In Apache httpd 2.2.x before 2.2.33 and 2.4.x before 2.4.26, use of the ap_get_basic_auth_pw() by third-party modules outside of the authentication phase may lead to authentication requirements being bypassed.",
                "Score": {
                  "CVSSv2": 7.5,
                  "CVSSv3": 9.8
                }
              },
              "CVE-2016-4975": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-4975",
                "Description": "Possible CRLF injection allowing HTTP response splitting attacks for sites which use mod_userdir. This issue was mitigated by changes made in 2.4.25 and 2.2.32 which prohibit CR or LF injection into the \"Location\" or other outbound header key or value. Fixed in Apache HTTP Server 2.4.25 (Affected 2.4.1-2.4.23). Fixed in Apache HTTP Server 2.2.32 (Affected 2.2.0-2.2.31).",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": 6.1
                }
              },
              "CVE-2015-3183": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2015-3183",
                "Description": "The chunked transfer coding implementation in the Apache HTTP Server before 2.4.14 does not properly parse chunk headers, which allows remote attackers to conduct HTTP request smuggling attacks via a crafted request, related to mishandling of large chunk-size values and invalid chunk-extension characters in modules/http/http_filters.c.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2015-0228": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2015-0228",
                "Description": "The lua_websocket_read function in lua_request.c in the mod_lua module in the Apache HTTP Server through 2.4.12 allows remote attackers to cause a denial of service (child-process crash) by sending a crafted WebSocket Ping frame after a Lua script has called the wsupgrade function.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2014-0231": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-0231",
                "Description": "The mod_cgid module in the Apache HTTP Server before 2.4.10 does not have a timeout mechanism, which allows remote attackers to cause a denial of service (process hang) via a request to a CGI script that does not read from its stdin file descriptor.",
                "Score": {
                  "CVSSv2": 5.0,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2012-4558": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-4558",
                "Description": "Multiple cross-site scripting (XSS) vulnerabilities in the balancer_handler function in the manager interface in mod_proxy_balancer.c in the mod_proxy_balancer module in the Apache HTTP Server 2.2.x before 2.2.24-dev and 2.4.x before 2.4.4 allow remote attackers to inject arbitrary web script or HTML via a crafted string.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2012-3499": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-3499",
                "Description": "Multiple cross-site scripting (XSS) vulnerabilities in the Apache HTTP Server 2.2.x before 2.2.24-dev and 2.4.x before 2.4.4 allow remote attackers to inject arbitrary web script or HTML via vectors involving hostnames and URIs in the (1) mod_imagemap, (2) mod_info, (3) mod_ldap, (4) mod_proxy_ftp, and (5) mod_status modules.",
                "Score": {
                  "CVSSv2": 4.3,
                  "CVSSv3": "N.A."
                }
              },
              "CVE-2012-2687": {
                "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-2687",
                "Description": "Multiple cross-site scripting (XSS) vulnerabilities in the make_variant_list function in mod_negotiation.c in the mod_negotiation module in the Apache HTTP Server 2.4.x before 2.4.3, when the MultiViews option is enabled, allow remote attackers to inject arbitrary web script or HTML via a crafted filename that is not properly handled during construction of a variant list.",
                "Score": {
                  "CVSSv2": 2.6,
                  "CVSSv3": "N.A."
                }
              }
            }
          }
        }
      },
      "Operating System": {
        "Possible vulnerabilities": {
          "CVE-2021-45868": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-45868",
            "Description": "In the Linux kernel before 5.15.3, fs/quota/quota_tree.c does not validate the block number in the quota tree (on disk). This can, for example, lead to a kernel/locking/rwsem.c use-after-free if there is a corrupted quota file.",
            "Score": {
              "CVSSv2": 4.3,
              "CVSSv3": 5.5
            }
          },
          "CVE-2021-4197": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-4197",
            "Description": "An unprivileged write to the file handler flaw in the Linux kernel's control groups and namespaces subsystem was found in the way users have access to some less privileged process that are controlled by cgroups and have higher privileged parent process. It is actually both for cgroup2 and cgroup1 versions of control groups. A local user could use this flaw to crash the system or escalate their privileges on the system.",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2022-28356": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-28356",
            "Description": "In the Linux kernel before 5.17.1, a refcount leak bug was found in net/llc/af_llc.c.",
            "Score": {
              "CVSSv2": 2.1,
              "CVSSv3": 5.5
            }
          },
          "CVE-2022-42703": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-42703",
            "Description": "mm/rmap.c in the Linux kernel before 5.19.7 has a use-after-free related to leaf anon_vma double reuse.",
            "Score": {
              "CVSSv2": "N.A.",
              "CVSSv3": 5.5
            }
          },
          "CVE-2012-2375": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-2375",
            "Description": "CVE-2012-2375 kernel: incomplete fix for CVE-2011-4131",
            "Score": {
              "CVSSv2": 4.6,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2022-1016": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-1016",
            "Description": "A flaw was found in the Linux kernel in net/netfilter/nf_tables_core.c:nft_do_chain, which can cause a use-after-free. This issue needs to handle 'return' with proper preconditions, as it can lead to a kernel information leak problem caused by a local, unprivileged attacker.",
            "Score": {
              "CVSSv2": "N.A.",
              "CVSSv3": 5.5
            }
          },
          "CVE-2022-0168": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-0168",
            "Description": "A denial of service (DOS) issue was found in the Linux kernel’s smb2_ioctl_query_info function in the fs/cifs/smb2ops.c Common Internet File System (CIFS) due to an incorrect return from the memdup_user function. This flaw allows a local, privileged (CAP_SYS_ADMIN) attacker to crash the system.",
            "Score": {
              "CVSSv2": "N.A.",
              "CVSSv3": 4.4
            }
          },
          "CVE-2021-3772": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-3772",
            "Description": "A flaw was found in the Linux SCTP stack. A blind attacker may be able to kill an existing SCTP association through invalid chunks if the attacker knows the IP-addresses and port numbers being used and the attacker can send packets with spoofed IP addresses.",
            "Score": {
              "CVSSv2": 5.8,
              "CVSSv3": 6.5
            }
          },
          "CVE-2021-3744": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-3744",
            "Description": "A flaw was found in the Linux kernel. A memory leak in the ccp-ops crypto driver can allow attackers to cause a denial of service. This vulnerability is similar with the older CVE-2019-18808. The highest threat from this vulnerability is to system availability.",
            "Score": {
              "CVSSv2": 2.1,
              "CVSSv3": 5.5
            }
          },
          "CVE-2021-3640": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2021-3640",
            "Description": "A flaw use-after-free in function sco_sock_sendmsg() of the Linux kernel HCI subsystem was found in the way user calls ioct UFFDIO_REGISTER or other way triggers race condition of the call sco_conn_del() together with the call sco_sock_sendmsg() with the expected controllable faulting memory page. A privileged local user could use this flaw to crash the system or escalate their privileges on the system.",
            "Score": {
              "CVSSv2": 6.9,
              "CVSSv3": 7.0
            }
          },
          "CVE-2020-35508": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2020-35508",
            "Description": "A flaw possibility of race condition and incorrect initialization of the process id was found in the Linux kernel child/parent process identification handling while filtering signal handlers. A local attacker is able to abuse this flaw to bypass checks to send any signal to a privileged process.",
            "Score": {
              "CVSSv2": 4.4,
              "CVSSv3": 4.5
            }
          },
          "CVE-2020-14331": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2020-14331",
            "Description": "A flaw was found in the Linux kernel’s implementation of the invert video code on VGA consoles when a local attacker attempts to resize the console, calling an ioctl VT_RESIZE, which causes an out-of-bounds write to occur. This flaw allows a local user with access to the VGA console to crash the system, potentially escalating their privileges on the system. The highest threat from this vulnerability is to data confidentiality and integrity as well as system availability.",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 6.6
            }
          },
          "CVE-2019-3901": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2019-3901",
            "Description": "A race condition in perf_event_open() allows local attackers to leak sensitive data from setuid programs. As no relevant locks (in particular the cred_guard_mutex) are held during the ptrace_may_access() call, it is possible for the specified target task to perform an execve() syscall with setuid execution before perf_event_alloc() actually attaches to it, allowing an attacker to bypass the ptrace_may_access() check and the perf_event_exit_task(current) call that is performed in install_exec_creds() during privileged execve() calls.",
            "Score": {
              "CVSSv2": 1.9,
              "CVSSv3": 4.7
            }
          },
          "CVE-2019-3900": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2019-3900",
            "Description": "An infinite loop issue was found in the vhost_net kernel module while handling incoming packets in handle_rx(). The infinite loop could occur if one end sends packets faster than the other end can process them. A guest user, maybe a remote one, could use this flaw to stall the vhost_net kernel thread, resulting in a DoS scenario.",
            "Score": {
              "CVSSv2": 6.8,
              "CVSSv3": 7.7
            }
          },
          "CVE-2019-3896": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2019-3896",
            "Description": "A double-free can happen in idr_remove_all() in lib/idr.c in the Linux kernel. An unprivileged local attacker can use this flaw for a privilege escalation or for a system crash and a denial of service (DoS).",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2019-14896": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2019-14896",
            "Description": "A heap-based buffer overflow vulnerability was found in the Linux kernel's Marvell WiFi chip driver. A remote attacker could cause a denial of service (system crash) or, possibly execute arbitrary code, when the lbs_ibss_join_existing function is called after a STA connects to an AP.",
            "Score": {
              "CVSSv2": 10.0,
              "CVSSv3": 9.8
            }
          },
          "CVE-2019-14821": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2019-14821",
            "Description": "An out-of-bounds access issue was found in the way Linux kernel's KVM hypervisor implements the Coalesced MMIO write operation. It operates on an MMIO ring buffer 'struct kvm_coalesced_mmio' object, wherein write indices 'ring->first' and 'ring->last' value could be supplied by a host user-space process. An unprivileged host user or process with access to '/dev/kvm' device could use this flaw to crash the host kernel, resulting in a denial of service or potentially escalating privileges on the system.",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 8.8
            }
          },
          "CVE-2019-14816": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2019-14816",
            "Description": "A vulnerability was found in the Linux kernel's Marvell WiFi chip driver. Where, while parsing vendor-specific informational attributes, an attacker on the same WiFi physical network segment could cause a system crash, resulting in a denial of service, or potentially execute arbitrary code. This flaw affects the network interface at the most basic level meaning the attacker only needs to affiliate with the same network device as the vulnerable system to create an attack path.",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2019-14814": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2019-14814",
            "Description": "A flaw was found in the Linux kernel’s implementation of the Marvell wifi driver, which can allow a local user who has CAP_NET_ADMIN or administrative privileges to possibly cause a Denial Of Service (DOS) by corrupting memory and possible code execution.",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2018-1095": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2018-1095",
            "Description": "The Linux kernel is vulnerable to an out-of-bound access bug in the fs/posix_acl.c:get_acl() function. An attacker could trick a legitimate user or a privileged attacker could exploit this to cause a system crash or other unspecified impact with a crafted ext4 image. Due to the nature of the flaw, privilege escalation cannot be fully ruled out, although we believe it is unlikely.",
            "Score": {
              "CVSSv2": 7.1,
              "CVSSv3": 5.5
            }
          },
          "CVE-2018-1094": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2018-1094",
            "Description": "The Linux kernel is vulnerable to a NULL pointer dereference in the ext4/xattr.c:ext4_xattr_inode_hash() function. An attacker could trick a legitimate user or a privileged attacker could exploit this to cause a NULL pointer dereference with a crafted ext4 image.",
            "Score": {
              "CVSSv2": 7.1,
              "CVSSv3": 5.5
            }
          },
          "CVE-2018-1092": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2018-1092",
            "Description": "The Linux kernel is vulnerable to a NULL pointer dereference in the ext4/mballoc.c:ext4_process_freed_data() function. An attacker could trick a legitimate user or a privileged attacker could exploit this by mounting a crafted ext4 image to cause a kernel panic.",
            "Score": {
              "CVSSv2": 7.1,
              "CVSSv3": 5.5
            }
          },
          "CVE-2018-1065": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2018-1065",
            "Description": "A flaw was found in the netfilter/iptables subsystem. A user with the netfilter modification capabilities could insert a rule which could panic the system.",
            "Score": {
              "CVSSv2": 4.7,
              "CVSSv3": 4.7
            }
          },
          "CVE-2017-7542": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-7542",
            "Description": "An integer overflow vulnerability in ip6_find_1stfragopt() function was found. A local attacker that has privileges (of CAP_NET_RAW) to open raw socket can cause an infinite loop inside the ip6_find_1stfragopt() function.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2017-7541": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-7541",
            "Description": "Kernel memory corruption due to a buffer overflow was found in brcmf_cfg80211_mgmt_tx() function in Linux kernels from v3.9-rc1 to v4.13-rc1. The vulnerability can be triggered by sending a crafted NL80211_CMD_FRAME packet via netlink. This flaw is unlikely to be triggered remotely as certain userspace code is needed for this. An unprivileged local user could use this flaw to induce kernel memory corruption on the system, leading to a crash. Due to the nature of the flaw, privilege escalation cannot be fully ruled out, although it is unlikely.",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2017-7495": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-7495",
            "Description": "A vulnerability was found in the Linux kernel where filesystems mounted with data=ordered mode may allow an attacker to read stale data from recently allocated blocks in new files after a system 'reset' by abusing ext4 mechanics of delayed allocation.",
            "Score": {
              "CVSSv2": 2.1,
              "CVSSv3": 5.5
            }
          },
          "CVE-2017-2647": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-2647",
            "Description": "A flaw was found that can be triggered in keyring_search_iterator in keyring.c if type->match is NULL. A local user could use this flaw to crash the system or, potentially, escalate their privileges.",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2017-2596": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-2596",
            "Description": "Linux kernel built with the KVM visualization support (CONFIG_KVM), with nested visualization(nVMX) feature enabled(nested=1), is vulnerable to host memory leakage issue. It could occur while emulating VMXON instruction in 'handle_vmon'. An L1 guest user could use this flaw to leak host memory potentially resulting in DoS.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 6.5
            }
          },
          "CVE-2017-15127": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-15127",
            "Description": "A flaw was found in the Linux kernel when freeing pages in hugetlbfs. This could trigger a local denial of service by crashing the kernel.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2017-12188": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-12188",
            "Description": "The Linux kernel built with the KVM visualization support (CONFIG_KVM), with nested visualization(nVMX) feature enabled (nested=1), was vulnerable to a stack buffer overflow issue. The vulnerability could occur while traversing guest page table entries to resolve guest virtual address(gva). An L1 guest could use this flaw to crash the host kernel resulting in denial of service (DoS) or potentially execute arbitrary code on the host to gain privileges on the system.",
            "Score": {
              "CVSSv2": 6.9,
              "CVSSv3": 7.8
            }
          },
          "CVE-2017-12168": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2017-12168",
            "Description": "An assertion failure issue was found in the Linux kernel's KVM hypervisor module built to support visualization on ARM64 architecture platforms. The failure could occur while accessing Performance Monitors Cycle Count Register (PMCCNTR) from a guest. A privileged guest user could use this flaw to crash the host kernel resulting in denial of service.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 6.0
            }
          },
          "CVE-2016-8650": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-8650",
            "Description": "A flaw was found in the Linux kernel key management subsystem in which a local attacker could crash the kernel or corrupt the stack and additional memory (denial of service) by supplying a specially crafted RSA key. This flaw panics the machine during the verification of the RSA key.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2016-7097": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-7097",
            "Description": "It was found that when file permissions were modified via chmod and the user modifying them was not in the owning group or capable of CAP_FSETID, the setgid bit would be cleared. Setting a POSIX ACL via setxattr sets the file permissions as well as the new ACL, but doesn't clear the setgid bit in a similar way. This could allow a local user to gain group privileges via certain setgid applications.",
            "Score": {
              "CVSSv2": 3.6,
              "CVSSv3": 4.4
            }
          },
          "CVE-2016-6828": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-6828",
            "Description": "A use-after-free vulnerability was found in tcp_xmit_retransmit_queue and other tcp_* functions. This condition could allow an attacker to send an incorrect selective acknowledgment to existing connections, possibly resetting a connection.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2016-5412": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-5412",
            "Description": "CVE-2016-5412 Kernel: powerpc: kvm: Infinite loop via H_CEDE hypercall when running under hypervisor-mode",
            "Score": {
              "CVSSv2": 4.6,
              "CVSSv3": 6.5
            }
          },
          "CVE-2016-4998": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-4998",
            "Description": "An out-of-bounds heap memory access leading to a Denial of Service, heap disclosure, or further impact was found in setsockopt(). The function call is normally restricted to root, however some processes with cap_sys_admin may also be able to trigger this flaw in privileged container environments.",
            "Score": {
              "CVSSv2": 5.6,
              "CVSSv3": 7.1
            }
          },
          "CVE-2016-4997": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-4997",
            "Description": "A flaw was discovered in processing setsockopt for 32 bit processes on 64 bit systems. This flaw will allow attackers to alter arbitrary kernel memory when unloading a kernel module. This action is usually restricted to root-privileged users but can also be leveraged if the kernel is compiled with CONFIG_USER_NS and CONFIG_NET_NS and the user is granted elevated privileges.",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2016-4470": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-4470",
            "Description": "A flaw was found in the Linux kernel's keyring handling code: the key_reject_and_link() function could be forced to free an arbitrary memory block. An attacker could use this flaw to trigger a use-after-free condition on the system, potentially allowing for privilege escalation.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2016-3070": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-3070",
            "Description": "A security flaw was found in the Linux kernel that an attempt to move page mapped by AIO ring buffer to the other node triggers NULL pointer dereference at trace_writeback_dirty_page(), because aio_fs_backing_dev_info.dev is 0.",
            "Score": {
              "CVSSv2": 4.6,
              "CVSSv3": 7.8
            }
          },
          "CVE-2016-10147": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2016-10147",
            "Description": "Algorithms not compatible with mcryptd could be spawned by mcryptd with a direct crypto_alloc_tfm invocation using a \"mcryptd(alg)\" name construct. This causes mcryptd to crash the kernel if an arbitrary \"alg\" is incompatible and not intended to be used with mcryptd.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2015-8970": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2015-8970",
            "Description": "The lrw_crypt() function in 'crypto/lrw.c' in the Linux kernel before 4.5 allows local users to cause a system crash and a denial of service by the NULL pointer dereference via accept(2) system call for AF_ALG socket without calling setkey() first to set a cipher key.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2015-5283": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2015-5283",
            "Description": "A NULL pointer dereference flaw was found in the SCTP implementation. A local user could use this flaw to cause a denial of service on the system by triggering a kernel panic when creating multiple sockets in parallel while the system did not have the SCTP module loaded.",
            "Score": {
              "CVSSv2": 4.7,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2015-3288": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2015-3288",
            "Description": "CVE-2015-3288 kernel: zero page memory arbitrary modification",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2015-3214": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2015-3214",
            "Description": "An out-of-bounds memory access flaw, leading to memory corruption or possibly an information leak, was found in QEMU's pit_ioport_read() function. A privileged guest user in a QEMU guest, which had QEMU PIT emulation enabled, could potentially, in rare cases, use this flaw to execute arbitrary code on the host with the privileges of the hosting QEMU process.",
            "Score": {
              "CVSSv2": 6.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2015-3212": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2015-3212",
            "Description": "A race condition flaw was found in the way the Linux kernel's SCTP implementation handled Address Configuration lists when performing Address Configuration Change (ASCONF). A local attacker could use this flaw to crash the system via a race condition triggered by setting certain ASCONF options on a socket.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2015-0239": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2015-0239",
            "Description": "It was found that the Linux kernel KVM subsystem's sysenter instruction emulation was not sufficient. An unprivileged guest user could use this flaw to escalate their privileges by tricking the hypervisor to emulate a SYSENTER instruction in 16-bit mode, if the guest OS did not initialize the SYSENTER model-specific registers (MSRs). Note: Certified guest operating systems for Red Hat Enterprise Linux with KVM do initialize the SYSENTER MSRs and are thus not vulnerable to this issue when running on a KVM hypervisor.",
            "Score": {
              "CVSSv2": 4.4,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2014-9420": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-9420",
            "Description": "It was found that the Linux kernel's ISO file system implementation did not correctly limit the traversal of Rock Ridge extension Continuation Entries (CE). An attacker with physical access to the system could use this flaw to trigger an infinite loop in the kernel, resulting in a denial of service.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2014-8173": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-8173",
            "Description": "A NULL pointer dereference flaw was found in the way the Linux kernel's madvise MADV_WILLNEED functionality handled page table locking. A local, unprivileged user could use this flaw to crash the system.",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2014-8159": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-8159",
            "Description": "It was found that the Linux kernel's Infiniband subsystem did not properly sanitize input parameters while registering memory regions from user space via the (u)verbs API. A local user with access to a /dev/infiniband/uverbsX device could use this flaw to crash the system or, potentially, escalate their privileges on the system.",
            "Score": {
              "CVSSv2": 6.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2014-7841": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-7841",
            "Description": "A flaw was found in the way the Linux kernel's SCTP implementation validated INIT chunks when performing Address Configuration Change (ASCONF). A remote attacker could use this flaw to crash the system by sending a specially crafted SCTP packet to trigger a NULL pointer dereference on the system.",
            "Score": {
              "CVSSv2": 5.0,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2014-5077": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-5077",
            "Description": "A NULL pointer dereference flaw was found in the way the Linux kernel's Stream Control Transmission Protocol (SCTP) implementation handled simultaneous connections between the same hosts. A remote attacker could use this flaw to crash the system.",
            "Score": {
              "CVSSv2": 7.1,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2014-3673": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-3673",
            "Description": "A flaw was found in the way the Linux kernel's Stream Control Transmission Protocol (SCTP) implementation handled malformed Address Configuration Change Chunks (ASCONF). A remote attacker could use either of these flaws to crash the system.",
            "Score": {
              "CVSSv2": 7.8,
              "CVSSv3": 7.5
            }
          },
          "CVE-2014-3647": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-3647",
            "Description": "A flaw was found in the way the Linux kernel's KVM subsystem handled non-canonical addresses when emulating instructions that change the RIP (for example, branches or calls). A guest user with access to an I/O or MMIO region could use this flaw to crash the guest.",
            "Score": {
              "CVSSv2": 1.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2014-3645": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-3645",
            "Description": "It was found that the Linux kernel's KVM subsystem did not handle the VM exits gracefully for the invept (Invalidate Translations Derived from EPT) instructions. On hosts with an Intel processor and invept VM exit support, an unprivileged guest user could use these instructions to crash the guest.",
            "Score": {
              "CVSSv2": 2.1,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2014-3611": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-3611",
            "Description": "A race condition flaw was found in the way the Linux kernel's KVM subsystem handled PIT (Programmable Interval Timer) emulation. A guest user who has access to the PIT I/O ports could use this flaw to crash the host.",
            "Score": {
              "CVSSv2": 4.7,
              "CVSSv3": 4.7
            }
          },
          "CVE-2014-3610": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-3610",
            "Description": "It was found that KVM's Write to Model Specific Register (WRMSR) instruction emulation would write non-canonical values passed in by the guest to certain MSRs in the host's context. A privileged guest user could use this flaw to crash the host.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2014-0205": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-0205",
            "Description": "A flaw was found in the way the Linux kernel's futex subsystem handled reference counting when requeuing futexes during futex_wait(). A local, unprivileged user could use this flaw to zero out the reference counter of an inode or an mm struct that backs up the memory area of the futex, which could lead to a use-after-free flaw, resulting in a system crash or, potentially, privilege escalation.",
            "Score": {
              "CVSSv2": 6.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2014-0101": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2014-0101",
            "Description": "A flaw was found in the way the Linux kernel processed an authenticated COOKIE_ECHO chunk during the initialization of an SCTP connection. A remote attacker could use this flaw to crash the system by initiating a specially crafted SCTP handshake in order to trigger a NULL pointer dereference on the system.",
            "Score": {
              "CVSSv2": 7.8,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-6431": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-6431",
            "Description": "CVE-2013-6431 kernel: net: fib: fib6_add: potential NULL pointer dereference",
            "Score": {
              "CVSSv2": 4.7,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-6381": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-6381",
            "Description": "CVE-2013-6381 Kernel: qeth: buffer overflow in snmp ioctl",
            "Score": {
              "CVSSv2": 6.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-4592": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-4592",
            "Description": "CVE-2013-4592 kernel: kvm: memory leak when memory slot is moved with assigned device",
            "Score": {
              "CVSSv2": 4.0,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-4348": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-4348",
            "Description": "CVE-2013-4348 kernel: net: deadloop path in skb_flow_dissect()",
            "Score": {
              "CVSSv2": 7.1,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-4345": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-4345",
            "Description": "CVE-2013-4345 kernel: ansi_cprng: off by one error in non-block size request",
            "Score": {
              "CVSSv2": 5.8,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-4312": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-4312",
            "Description": "It was found that the Linux kernel did not properly account file descriptors passed over the unix socket against the process limit. A local user could use this flaw to exhaust all available memory on the system.",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 6.2
            }
          },
          "CVE-2022-1943": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2022-1943",
            "Description": "A flaw out of bounds memory write in the Linux kernel UDF file system functionality was found in the way user triggers some file operation which triggers udf_write_fi(). A local user could use this flaw to crash the system or potentially",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2015-5364": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2015-5364",
            "Description": "The (1) udp_recvmsg and (2) udpv6_recvmsg functions in the Linux kernel before 4.0.6 do not properly consider yielding a processor, which allows remote attackers to cause a denial of service (system hang) via incorrect checksums within a UDP packet flood.",
            "Score": {
              "CVSSv2": 7.8,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-3301": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-3301",
            "Description": "CVE-2013-3301 Kernel: tracing: NULL pointer dereference",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-2206": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-2206",
            "Description": "CVE-2013-2206 kernel: sctp: duplicate cookie handling NULL pointer dereference",
            "Score": {
              "CVSSv2": 5.4,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-2148": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-2148",
            "Description": "CVE-2013-2148 Kernel: fanotify: info leak in copy_event_to_user",
            "Score": {
              "CVSSv2": 2.1,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-2094": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-2094",
            "Description": "CVE-2013-2094 kernel: perf_swevent_enabled array out-of-bound access",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-1943": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-1943",
            "Description": "CVE-2013-1943 kernel: kvm: missing check in kvm_set_memory_region()",
            "Score": {
              "CVSSv2": 4.4,
              "CVSSv3": 7.8
            }
          },
          "CVE-2013-1797": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-1797",
            "Description": "CVE-2013-1797 kernel: kvm: after free issue with the handling of MSR_KVM_SYSTEM_TIME",
            "Score": {
              "CVSSv2": 6.8,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-1774": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-1774",
            "Description": "CVE-2013-1774 Kernel: USB io_ti driver NULL pointer dereference in routine chase_port",
            "Score": {
              "CVSSv2": 4.0,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-1767": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-1767",
            "Description": "CVE-2013-1767 Kernel: tmpfs: fix use-after-free of mempolicy object",
            "Score": {
              "CVSSv2": 6.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-1763": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-1763",
            "Description": "CVE-2013-1763 kernel: sock_diag: out-of-bounds access to sock_diag_handlers[]",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2013-0290": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2013-0290",
            "Description": "CVE-2013-0290 kernel: net: infinite loop in __skb_recv_datagram()",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2012-2744": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-2744",
            "Description": "CVE-2012-2744 kernel: netfilter: null pointer dereference in nf_ct_frag6_reasm()",
            "Score": {
              "CVSSv2": 7.8,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2012-2390": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-2390",
            "Description": "CVE-2012-2390 kernel: huge pages: memory leak on mmap failure",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2012-2384": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-2384",
            "Description": "CVE-2012-2384 kernel: drm/i915: integer overflow in i915_gem_do_execbuffer()",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2012-2383": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-2383",
            "Description": "CVE-2012-2383 kernel: drm/i915: integer overflow in i915_gem_execbuffer2()",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2012-2319": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-2319",
            "Description": "CVE-2012-2319 kernel: Buffer overflow in the HFS plus filesystem (different issue than CVE-2009-4020)",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2012-2136": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-2136",
            "Description": "CVE-2012-2136 kernel: net: insufficient data_len validation in sock_alloc_send_pskb()",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2012-2133": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-2133",
            "Description": "CVE-2012-2133 kernel: use after free bug in \"quota\" handling",
            "Score": {
              "CVSSv2": 4.0,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2012-0044": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2012-0044",
            "Description": "CVE-2012-0044 kernel: drm: integer overflow in drm_mode_dirtyfb_ioctl()",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": 7.8
            }
          },
          "CVE-2011-4326": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2011-4326",
            "Description": "CVE-2011-4326 kernel: wrong headroom check in udp6_ufo_fragment()",
            "Score": {
              "CVSSv2": 7.1,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2011-4097": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2011-4097",
            "Description": "CVE-2011-4097 kernel: oom_badness() integer overflow",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2011-4081": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2011-4081",
            "Description": "CVE-2011-4081 kernel: crypto: ghash: null pointer deref if no key is set",
            "Score": {
              "CVSSv2": 4.9,
              "CVSSv3": 5.5
            }
          },
          "CVE-2011-2497": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2011-2497",
            "Description": "CVE-2011-2497 kernel: bluetooth: buffer overflow in l2cap config request",
            "Score": {
              "CVSSv2": 8.3,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2011-1770": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2011-1770",
            "Description": "CVE-2011-1770 kernel: dccp: handle invalid feature options length",
            "Score": {
              "CVSSv2": 7.8,
              "CVSSv3": 7.5
            }
          },
          "CVE-2011-1494": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2011-1494",
            "Description": "CVE-2011-1494 CVE-2011-1495 kernel: drivers/scsi/mpt2sas: prevent heap overflows",
            "Score": {
              "CVSSv2": 6.9,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2011-1093": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2011-1093",
            "Description": "CVE-2011-1093 kernel: dccp: fix oops on Reset after close",
            "Score": {
              "CVSSv2": 7.8,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2010-4526": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-4526",
            "Description": "CVE-2010-4526 kernel: sctp: a race between ICMP protocol unreachable and connect()",
            "Score": {
              "CVSSv2": 7.1,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2010-4162": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-4162",
            "Description": "CVE-2010-4162 kernel: bio: integer overflow page count when mapping/copying user data",
            "Score": {
              "CVSSv2": 4.7,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2010-4157": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-4157",
            "Description": "CVE-2010-4157 kernel: gdth: integer overflow in ioc_general()",
            "Score": {
              "CVSSv2": 6.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2010-3865": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-3865",
            "Description": "CVE-2010-3865 kernel: iovec integer overflow in net/rds/rdma.c",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2010-3705": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-3705",
            "Description": "CVE-2010-3705 kernel: sctp memory corruption in HMAC handling",
            "Score": {
              "CVSSv2": 8.3,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2010-3432": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-3432",
            "Description": "CVE-2010-3432 kernel: sctp: do not reset the packet during sctp_packet_config",
            "Score": {
              "CVSSv2": 7.8,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2010-3301": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-3301",
            "Description": "CVE-2010-3301 kernel: IA32 System Call Entry Point Vulnerability",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2010-3084": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-3084",
            "Description": "CVE-2010-3084 kernel: niu: buffer overflow for ETHTOOL_GRXCLSRLALL",
            "Score": {
              "CVSSv2": 7.2,
              "CVSSv3": "N.A."
            }
          },
          "CVE-2010-3078": {
            "NIST_URL": "https://nvd.nist.gov/vuln/detail/CVE-2010-3078",
            "Description": "CVE-2010-3078 kernel: xfs: XFS_IOC_FSGETXATTR ioctl memory leak",
            "Score": {
              "CVSSv2": 2.1,
              "CVSSv3": 5.5
            }
          }
        },
        "Details": "general purpose: Linux, Linux(2.6.X)"
      }
    },
    "Summary of vulnerabilities found": {
      "os": 100,
      "tcp": 46
    }
  }
}
